ability
able
absolute
absolutely
accessory
across
actual
actually
adapter
adaptive
added
addition
additional
adds
adjust
adjusts
advertised
again
ago
almost
along
already
although
always
amazing
amazon
amount
android
angle
annoying
another
anymore
anyone
anything
anyway
anywhere
apart
app
apparently
appear
appeared
apple
apples
apps
april
arch
aren't
around
arrived
asus
auto
automatically
available
away
awesome
awful
b
background
backlight
backlighting
bad
bands
bar
barely
bargain
base
based
basically
basket
bass
battery
beast
beat
beats
beautiful
became
bed
been
before
began
beginner
being
believe
best
better
between
beyond
big
bigger
bit
black
blade
blank
blu
blue
bluetooth
blurry
board
book
books
boot
both
bother
bottom
bought
box
boyfriend
brand
break
breville
bright
brightness
broke
broken
bucks
budget
build
built
built-in
builtin
bundle
business
button
buttons
buy
buying
cable
call
calls
came
camera
cameras
can't
cannot
canon
card
cardboard
care
careful
carrier
carry
cartridges
case
cell
cellphone
champagne
chance
change
changing
characters
charge
charged
charger
charging
cheap
cheaper
cheaply
china
choice
christmas
claimed
class
clean
clear
clearer
clearly
close
color
colors
combo
comes
comfortable
comfy
coming
communication
company
compared
complain
complaint
complaints
completely
computer
condition
connection
connectivity
cons
considering
constantly
contrast
control
controller
controls
convenient
cool
corners
correct
correctly
cost
cough
couldn't
couple
course
cover
cpu
crashes
creed
crisp
crisper
crystal
cuisinart
current
customer
cut
daily
damage
damaged
dark
darn
date
daughter
days
dead
deal
decent
decided
decision
defect
defective
definitely
delivered
delivery
describe
design
designed
device
devices
did
didn't
died
dies
difference
differences
different
difficult
difficulty
direction
disappear
disappointed
disappointing
disappointment
dishwasher
disk
display
distracting
does
doesn't
doing
don't
done
down
download
downside
drive
driving
drop
dropped
dry
dslr
due
durable
dvr
e-reader
ear
ears
ease
easier
easily
easy
economical
edge
efficient
efficiently
either
else
email
end
ended
enjoy
enjoying
enough
entry
ereader
especially
estimated
ever
every
everyone
everything
everywhere
exact
exactly
exceeded
excellent
except
exchange
expect
expectations
expected
expensive
experience
expert
external
extra
extract
extremely
eyes
fact
factor
factory
fail
failed
falling
family
fantastic
far
fast
faster
fastest
favorite
feature
features
feel
feels
feet
fell
felt
few
figure
filter
finally
find
fine
fire
fit
fits
five
fix
flagship
flash
flaw
flawless
flimsy
focus
fog
font
fonts
foreign
forward
found
fountain
freaking
free
freeze
friend
froze
frozen
fruit
fruits
frustrated
full
fun
function
functional
functions
future
g
galaxy
game
games
gaming
garbage
gave
gb
gear
gen
generation
getting
gift
gimmicky
giving
glad
glare
glitches
glitchy
god
goes
going
gold
gone
good
google
got
gotten
gps
graphics
great
greatest
green
guess
guide
gym
had
half
hand
hands
happen
happier
happy
hard
hardware
has
hate
haven't
having
headphone
headphones
headset
hear
heavy
help
helps
here
hesitant
hesitation
high
highly
hinge
hinges
hold
home
honestly
hope
hopefully
hoping
horrible
hot
hour
hours
hover
however
hp
huge
hurt
husband
i'd
i'll
i'm
i've
idea
iii
image
images
imagine
impossible
impressed
impressive
improved
improvement
improvements
including
incredible
incredibly
indicated
info
ink
inside
install
installed
instead
integration
internal
internet
ipad
iphone
iphones
ipod
isn't
issue
issues
it's
item
itself
jack
jams
job
juice
juiced
juicer
juicing
jump
junk
kale
keep
keeps
key
keyboard
keys
kind
kinda
kindle
kit
knew
know
laces
lag
lags
language
lap
laptop
large
larger
laser
last
lasts
later
latest
learn
learned
least
leave
led
leds
left
lenovo
lens
less
let
lets
level
lg
life
light
lighter
lighting
lights
lightweight
like
liked
line
listen
listening
literally
little
load
location
lock
lollipop
long
longer
looked
looking
looks
lot
lots
loud
louder
love
loved
loves
low
lte
luck
mac
machine
made
mail
main
make
makes
making
malware
managed
many
mark
market
match
matches
matter
may
maybe
mean
means
media
meh
memory
mess
mic
micro
middle
might
million
mind
mine
minor
minutes
missing
mobile
mode
model
models
mom
money
month
months
more
morning
moto
motorola
mouse
move
movement
movie
movies
moving
mp
much
multiple
music
must
n
name
navigate
nearly
need
needed
needs
netflix
network
never
new
next
nexus
nice
night
nightmare
nike
nikes
nikon
no
noise
noisy
non
not
note
noted
nothing
noticed
novice
nowhere
numbers
obviously
off
offer
offered
offers
office
often
oh
ok
okay
old
older
once
online
open
opened
opinion
opted
options
orange
order
ordered
ordering
origami
original
os
others
otherwise
outstanding
overall
overheating
own
owned
package
packaging
pad
page
pages
paid
pain
pair
paper
paperwhite
part
partially
parts
party
past
pay
pc
peel
penny
people
perfect
perfectly
performance
period
person
personal
phone
phones
photo
photographer
photography
photos
physical
pick
pics
picture
pictures
piece
pieces
place
placed
places
plain
plane
plastic
play
playing
please
pleased
plug
plugged
plus
point
points
poor
port
position
power
prefer
press
pressing
pretty
previous
previously
price
priced
pricey
print
printed
printer
printers
printing
prints
pro
probably
problem
problems
processor
produce
produces
product
products
properly
provides
pulp
purchase
purchased
purchasing
pure
put
quality
quick
quickly
quiet
quit
quite
ram
ran
range
rating
read
reader
readers
reading
ready
real
realized
really
reason
reasonable
reasons
received
recommend
recommended
red
refund
regret
reliable
remote
remove
removed
repair
replace
replaced
replacement
research
resistant
response
responsive
restart
return
returned
returning
review
reviews
rich
right
risk
road
room
router
run
running
runs
said
sale
same
samsung
satisfied
save
saw
saying
says
screen
screens
scroll
scrolling
sd
second
seeing
seem
seemed
seems
seen
sell
seller
send
sensitive
sent
series
service
set
sets
settings
setup
several
sharp
shift
shipped
shocked
shoe
shoes
shoot
shopping
short
shortly
shots
should
show
showed
shower
shows
shuts
side
sign
sim
simple
simply
since
single
sits
size
skeptical
sleek
slightly
slow
slower
slowly
small
smaller
smartphone
smartphones
smell
smooth
snap
sneakers
snug
social
soft
software
sold
solid
somebody
someone
something
sometimes
sony
soon
sorted
sound
sounds
space
speaker
speakerphone
speakers
special
specific
speed
speeds
spend
spent
spinach
sprint
squeak
squeaking
ssd
stand
standard
star
stars
start
started
starter
starting
stay
step
stereo
stick
still
stink
stop
stopped
store
story
strong
stuck
studio
stuff
stupid
style
stylish
such
sucks
sufficient
summer
super
superb
superior
support
supported
supposed
sure
sweet
switched
switching
tablet
take
taken
takes
taking
tap
team
tech
technology
tell
terrible
text
thanks
that's
there's
they're
thin
thing
things
thinking
those
though
thought
three
threw
thrilled
through
throwing
thus
till
time
times
tired
today
toe
together
too
took
tooth
top
totally
touch
touching
touchscreen
transfer
travel
tray
tried
trip
trouble
true
truly
trust
try
trying
turn
turned
turning
turns
tv
tvs
twice
type
u
uhd
ultra
unbelievable
unbelievably
unfortunately
unit
unity
unless
until
update
upgrade
upgraded
ups
usa
usage
usb
used
useful
useless
user
using
usually
value
veggies
verizon
version
versions
very
video
videos
viewing
virus
voice
volume
voyage
vr
vs
wait
waited
waiting
walk
wall
wanted
wants
warehouse
warranty
wasn't
waste
wasted
watch
watching
water
waterproof
weak
wear
weather
week
weeks
weight
weird
went
were
wet
what's
wheel
whenever
where
while
white
whole
why
wife
wifi
windows
wireless
wish
within
without
won't
wonderful
word
words
worked
working
works
world
worn
worse
worst
worth
wouldn't
wow
wrong
years
yellow
yesterday
yet
you'll
yourself
youtube
zoom
